import { lib, game, ui, get, ai, _status } from "noname";

export const modules = {
	//普瑞赛斯
	puruisaisimrfz:{
		zaowuzhu:{
			name:"造物主",
			intro:["博士，","你想要的一切我都能实现"],
			effect:{
				changeSkill:["bianyimrfz"],
				intro:[
					`·体力上限/初始体力值 + 1`,
					`·变更技能组：`,`【编译】`,()=>get.skillInfoTranslation("bianyimrfz")
				],
				content(player,info){
					if(info){
						info.hp = 4;
						info.maxHp  = 4;
					}
				}
			},
		},
	},

	//嵯峨
	cuoemrfz:{
		hechuxuntuo:{
			name:"何处寻驼？",
			intro:["<font color='#8a2be2'>设计者：涵涵喵</font>","温热的气息拂过脸庞，熟悉的景象开始在视野边缘生长。回过神来，周遭的一切已然与回忆中别无二致，老樟树下还倚着师兄亲手雕的木驮兽，黑毛的小牙兽正抱在上面磨着长牙。","斗笠边沿毛毛刺刺的棕丝刮过她的额头，挟来熟悉的棉霉气味。嵯峨心里一惊，从眼前踱过的老僧不是别人，正是住持爷爷。她赶忙打起精神，端正姿态，但僵硬的腰背却不允许她挺起身子。当初下山时，年少的嵯峨才刚及住持爷爷的肩高，而如今，她已被上百个春天的落雨和上百个秋天的落叶压得佝偻龙钟，又一次只及住持爷爷的肩高了。","“住持爷爷，小僧......”","老住持似乎对她要说的话不以为意，只撇了撇头，示意她挪挪脚，然后毫不客气地将拖把伸了过来。她只得拖着沉重的双腿，一面颤颤巍巍避着拖把，一面磕磕巴巴诉说困惑。这拖把杆子嵯峨是认得的——那是住持爷爷曾经与她过招时所用的栎木杆。只是不知为何，如今它被绑上布条，成了擦地的拖把。" ,
			"“小僧......愚僧惭愧，但愚僧还有疑惑要求问！",
			"“愚僧在外游历，至今也有百年之久了，可到头来，却好像越来越糊涂了。初下山时，愚僧以为事物总有分明的道理，诚然世间种种都令人感到不解，但也处处皆有答案可寻，因此在夕先生的画卷中盘桓十载，也只觉得妙趣横生。",
			"“可后来，愚僧自认的道理全都没了道理。见得越多，就越觉得世间的人和事全是同一副模样。人活在世间不过都是拿一面镜子，或照着自己，或照着别人，然后四处取些色彩，在镜子里的人形上涂涂抹抹、修修补补罢了。人将那镜子涂得满满当当、密不透光，便以为自己通善恶、知真假了。愚僧求学问道上百年，最后瞅瞅行囊，得来的全是脏兮兮的镜子。愚僧不明白，如果世道净是如此，还能在何处见道？”",
			"待嵯峨说完，老住持才停下手中活计，抬头答道：“若你是驮兽，便能见道了。”说罢，不等她再发问，老住持便抄起拖把，直朝她脸上打来。",
			"",
			"嵯峨从梦中惊醒时已是正午。定睛一瞧，原来是同行的驮兽等得不耐烦，正用粗大的舌头舔刷着她的脸。",
			"“好了，走了！”"],
			effect:{
				changeSkill:["qianxianmrfz","ziwumrfz"],
				intro:[
					`·变更技能组：`,`【千相】`,()=>get.skillInfoTranslation("qianxianmrfz")
					,`【自悟】`,()=>get.skillInfoTranslation("ziwumrfz")
					,`【遁空】(非初始技能)`,()=>get.skillInfoTranslation("dunkongmrfz")
				],
			},
		},
	},
}

export const modulesList = Object.entries(modules).flatMap(([key, subModules]) =>
	Object.entries(subModules).map(([name, module]) => module.id ?? name)
);