/**
 * @type {Record<string,WhichWayPopTipConfig>}
 */
export const WhichWayPopTipsConfig = {
	//回合轮
	huihelun:{
		name:"回合轮",
		info:["回合轮","指一名角色上一轮其回合开始（若本轮为第一轮则改为本轮开始时）到其本轮回合开始这一时间段。"],
		type:"rule",
		trim:true,
	},
	AveMujica:{
		info:["AveMujica角色","丰川祥子、若叶睦、祐天寺若麦、三角初华、八幡海铃"],
		trim:true,
	},
	centralArea:{
		name:"中央区",
		info:"特指本回合进入弃牌堆的牌",
	},
	cardUseType:{
		name:"牌的结算方法",
		info:"『牌的结算方法』<br>使用、打出、重铸、弃置",
	},
	byRecast:{
		name:"以重铸的方式",
		info:["以重铸的方式","将一张牌同时执行重铸效果和其他效果"],
		trim:true,
	},
	zhiheng:{
		name:"制衡",
		info:["制衡","往往以“制衡X”的描述出现，效果为“弃置X张牌，然后摸X张牌”"],
		trim:true,
	},
	jishipai:{
		name:"即时牌",
		info:["即时牌","即普通锦囊牌和基本牌"],
		trim:true,
	},
	enchanting:{
		name:"附魔",
		info:["若附魔的是：", "属性：令附魔对象的属性或特性改为附魔词条。", "牌：令附魔对象的作用效果加入附魔词条中的作用效果，附魔牌的作用效果于附魔对象的作用效果后执行。", "技能：令附魔对象的拥有者在附魔对象或附魔事件的结算过程中视为拥有附魔词条中包含的技能。"],
		trim:true,
	},
	/**
	 * ♠：上
	 * ♣：下
	 * ♦：左
	 * ♥：右
	 */
	stratagemSupport:{
		name:"战略支援",
		info:["根据弃置的牌的花色（有顺序要求）组成对应的战略指令，并执行相应的效果。","(下述描述的格式为“名称（花色要求）：对应的效果”)",
			"重新补给（♣♣♠♦）：令一名角色摸两张牌并回复一点体力。",
			"“骏鹰”扫射（♠♦♦）：对攻击范围内的一名其他角色造成1点伤害。",
			"“骏鹰”烟雾攻击（♠♦♠♣）：令一名其他角色下一张使用的牌无效。",
			"“骏鹰”空袭（♠♦♣♦）：对攻击范围内的一名其他角色造成2点伤害。",
			"“骏鹰”500kg（♠♦♣♣♣）：对攻击范围内的一名其他角色造成3点伤害。",
			"城防炮空爆攻击（♦♦♦）：视为对至多两名其他角色使用一张【万箭齐发】。",
			"城防炮精准攻击（♦♦♠）：视为对一名其他角色使用两张【万箭齐发】。",
			"城防炮毒气攻击（♦♦♣♠）：令一名其他角色弃置两张手牌。",
			"城防炮凝固汽油弹火力网（♥♥♣♦♥♠）：视为对至多三名其他角色使用一张【万箭齐发】",
			"380mm城防炮高爆火力网（♥♣♠♠♦♣♣）：视为对任意名其他角色使用五张【万箭齐发】。"
		],
		trim:true,
	},
}